:PROPERTIES:
:ID:       8c823305-1e78-4282-a8bf-aef1e852eeee
:END:
#+TITLE: Org Babel: Files Modified During Execution
#+CATEGORY: slips
#+TAGS:

* Testing Temporary Files

Some scripts are pushed to the following paths in =/tmp/babel-*= and these seem
to be cleared out between executions.

#+name: ob-tmpdir
#+begin_src emacs-lisp
org-babel-temporary-directory
#+end_src

#+RESULTS: ob-tmpdir
: /tmp/babel-Z8282u

#+name: ob-stable-tmpdir
#+begin_src emacs-lisp
org-babel-temporary-stable-directory
#+end_src

#+RESULTS: ob-stable-tmpdir
: /tmp/babel-stable-182

This script captures the temporary file while it exists. Only one file shows,
but ob-execution invocations create a dependency tree of scripts to
execute. Doing so here requires confirming five times.

#+begin_src sh :results output :noweb yes :exports both
tree <<ob-tmpdir()>> <<ob-stable-tmpdir()>>

echo \n\n====================\n
echo temporary script file: "$(ls <<ob-tmpdir()>>/*)"
echo \n====================\n\n

cat <<ob-tmpdir()>>/*
#+end_src

#+RESULTS:
#+begin_example
/tmp/babel-Z8282u
└── ob-input-1gdf8R
/tmp/babel-stable-182

1 directory, 1 file
nn====================n
temporary script file: /tmp/babel-Z8282u/ob-input-1gdf8R
n====================nn
tree /tmp/babel-Z8282u /tmp/babel-stable-182

echo \n\n====================\n
echo temporary script file: "$(ls /tmp/babel-Z8282u/*)"
echo \n====================\n\n

cat /tmp/babel-Z8282u/*
#+end_example

